{
    "blogs": [
        {
            "id": 1,
            "title": "Identity and Values",
            "month": "05/07",
            "year": "2019",
            "image": "/images/rene-bohmer-YeUVDKZWSZ4-unsplash.jpg",
            "description": "A blog exploring my personal values, strengths, and limitations, and how these will impact my learning and development throughout this course.",
            "heading-1": "Core Personal Values",
            "section-1": "One of my core personal values is honesty, as I have damaged people close to me by flirting with the opposite side of this when I was younger, and don’t want to go back to that. I have also found, through experience, that honesty generally gives the best result, even if it may be the more difficult path to take at the time and may not at first appear to be a good option.",
            "section-2": "An example of this took place in one of my previous workplaces, where one of our roles was to distribute controlled medication to clients. Due to the intricacies around this and the health and safety standards we needed to meet, there were strict procedures we were supposed to take when doing this, most important of all, giving the client exactly what was designated on their medical records. At the time of this example, the shift I was on was extremely busy, and we were understaffed, and there was some confusion with a client’s medication. As there were other clients getting restless demanding attention, instead of taking the time away from things to carefully go through this, I just asked the client what medication he was supposed to get, as I was swamped with demands and just assumed he would know what he was supposed to be taking and just tell me that. At this time, I was still quite naive, as I hadn’t worked with addicts for very long. Suffice to say, the client stated a dose larger than he was supposed to get, and I gave it to him. Thankfully, no negative health impacts resulted from this, but due to this, there was confusion with the medical records the next day, as they were not lining up with what they were supposed to. Seeing this, I came forward to my boss and admitted I must have messed it up, as I hadn’t gone through the right process. He was fairly stern with explaining the right process to me and reiterating why it was so important, but I am glad I did this as it helped set things straight for me and reiterate to me why I need to put following procedures first and foremost, and retrospectively, it was definitely the best choice, as I have heard from an ex-colleague that she did this, and didn’t tell him, and when the records didn’t line up, he went back through the camera records, saw that it was her, pulled her into her office, and yelled at her for a long time. She left it in tears. After multiple instances of this kind of honest ethic, and having to uncomfortably front up several other times for other things during my time in that workplace, I was promoted to one of the highest positions there, which I think was no doubt in no small part due to my straightforward honesty, as there was a lot of responsibility put on me in that position and my boss must have had a huge amount of trust in me to allow me the freedom and self autonomy I had in it.",
            "heading-2": "Strengths and Limitations",
            "section-3": "I have taken the Myer Briggs test and this identified me as a Logician (INTP-T).",
            "section-4": "The strengths highlighted in this that I identify with are being a good analyst and abstract thinker, being imaginative, and being objective. I think these will benefit my learning as they allow me to tackle problems from an analytical perspective, compartmentalizing larger tasks down into manageable chunks and sequentially completing them in order to eventually complete the overall task. This method that I have had to utilize a lot in the past in high workload jobs has helped manage tasks that would at first appear to be insurmountable, but once sectioned off into their own little pieces, become relatively manageable. I think being imaginative also helps as it allows me to find original and unique methods to solve problems; if I am struggling with one way to tackle a problem, I usually don’t have much trouble finding another angle to attack it from. Finally, being objective helps me to remove myself from sometimes emotionally straining situations, and look at them from a calm, observer's perspective. This has helped me in the past to analyse important decisions around difficult clients in my old workplace, and I believe it will help immensely in teamwork environments to help resolve conflicts if and when they may arise.",
            "section-5": "There were a few particular limitations revealed from the Myer Briggs test that really resonated with me and have stagnated the progression of my personal development for the past several years. These are a pervasive fear of failure and constant second guessing, alongside a cripplingly high level of perfectionism. I have very high standards I set for myself, which are, unfortunately, more idealistic than realistic. This results in me continuously setting lofty goals, because of the expectations of these high standards, and eventually failing to meet these goals because they were set too far out of the reach of myself in reality. This is a descrtructive cycle that demotivates me to meaningfully progress in something I want to develop my skills in, because I start it, set high goals for myself, and then don’t meet those goals, eventually becoming demotivated and giving up. I am aware that to meet such goals, I need to put in a lot of practice to get good enough to achieve them, but at the same time, the lack of immediate progress and the harsh reality of my novice work is often so demotivating I quit long before I am even close to meeting those goals. This results in stagnant progression, because instead of knuckling down and working at something, I will then flee to a different topic, with lofty goals filling my mind with hope again, only to fall into the same destructive cycle, because the core issue is still there. In order to combat this, I really need to focus on two things: developing healthy, productive habits, so that I don’t rely so much on motivation to get me to be productive, and setting SMART goals, goals that are specific, measurable, achievable, relevant, and time-bound. These should help as if a healthy productive habit is developed, then I don’t need to rely on some fickle burst of motivation to do anything; I would be doing it as part of my daily routine anyway, and thus, with enough days elapsed, I would experience some sort of meaningful progression. With SMART goals, these are specifically designed to forward productivity, as they provide the meaningful sense of achievement that is actually realistic to achieve, and so, if managed appropriately, shouldn’t get me stuck in the same destructive cycle as usual."
        },
        {
            "id": 2,
            "title": "Learning Plan",
            "month": "06/07",
            "year": "2019",
            "image": "/images/patrick-tomasso-Oaqk7qqNh_c-unsplash.jpg",
            "description": "My learning plan. Outlines long-term goals, strengths, weaknesses, and the commitments I will need to make to utilize these to meet these goals."
        },
        {
            "id": 3,
            "title": "CSS Positiong",
            "month": "07/07",
            "year": "2019",
            "image": "/images/pankaj-patel-6JVlSdgMacE-unsplash.jpg",
            "description": "A blog about CSS positioning properties and how they can be used. Explores static, relative, absolute, and fixed positioning, as well as the properties that are commonly shared between them, such as the z-index and manual positioning properties."
        },
        {
            "id": 4,
            "title": "Emotional Intelligence",
            "month": "10/07",
            "year": "2019",
            "image": "/images/art-by-lonfeldt-gKlnwCvghTU-unsplash.jpg",
            "description": "A blog exploring emotional intelligence, what it is, the various models that seek to map it, and comparisons to more traditional views of intelligence in the form of the intelligence quotient."
        },
        {
            "id": 5,
            "title": "HTML, CSS, & JavaScript",
            "month": "14/07",
            "year": "2019",
            "image": "/images/markus-spiske-xekxE_VR0Ec-unsplash.jpg",
            "description": "A blog exploring the roles of HTML, CSS, and Javascript, as well as logical concepts within Javascript, through real-world analogies. More technical concepts like the DOM, Arrays, Objects, and Functions are also explored."
        },
        {
            "id": 6,
            "title": "Neuroplasticity & Growth Mindset",
            "month": "15/07",
            "year": "2019",
            "image": "/images/david-clode-75CxJTYeUYs-unsplash.jpg",
            "description": "A blog outlining the principles of Neuroplasticity and how the brain learns, develops, and operates with this system. The benefits of a Growth Mindset, compared to a Fixed Mindset, are also explored, as well as how both the principles of Neuroplasticity, and the benefits of maintaining a Growth Mindset, can be applied in my Learning Plan."
        },
        {
            "id": 7,
            "title": "Problem Solving",
            "month": "18/07",
            "year": "2019",
            "image": "/images/joshua-coleman-fXls-tVemno-unsplash.jpg",
            "description": "A blog exploring the implementation of pseudocode to combat difficult tasks and chronic procrastionation habits, as well as an outlining of my understanding of the Rubber Ducky Method."
        },
        {
            "id": 8,
            "title": "Core Exploration",
            "month": "22/07",
            "year": "2019",
            "image": "/images/leio-mclaren-leiomclaren-e1AtwT_cGPU-unsplash.jpg",
            "description": "An exploration of the impact of the core material from Foundations."
        }
    ]
}